// В задачах, приведенных ниже надо написать программы реализации классов. Эти программы должны быть представлены тремя файлами: 
// •	заголовочным файлом (.h – файлом) объявления класса и нужных типов данных,
// •	файлом описания методов класса (.cpp- файлом)
// •	файлом с функцией main, тестирующей методы класса.

// Функция main задачи должна тестировать все методы класса!
// Во всех задачах этого раздела в дополнение к требованиям, описанным в постановках задач, для каждого класса надо реализовать:
// •	Все типы конструкторов и деструктор.
// •	Должен быть реализован конструктор преобразования типов <Class>(const char* str), создающий объект из его строкового представления.
// •	Метод char* aschar() возвращающий строковое представление объекта 
// •	Перегрузку операций класса.
// •	Перегрузку операций ввода/вывода в поток.

// 3.	Класс MyString